<?xml version="1.0" encoding="utf-8"?>
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.2" schemaVersion="1.0"
  xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="classificationbanner"
      namespace="ClassificationBanner.Policies.ClassificationBanner" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <resources minRequiredRevision="1.0" />
  <categories>
    <category name="CAT_ClassificationBanner" displayName="$(string.CAT_ClassificationBanner)" />
    <category name="CAT_ClassificationBanner_Display"
      displayName="$(string.CAT_ClassificationBanner_Display)">
      <parentCategory ref="CAT_ClassificationBanner" />
    </category>
    <category name="CAT_ClassificationBanner_SystemInfo"
      displayName="$(string.CAT_ClassificationBanner_SystemInfo)">
      <parentCategory ref="CAT_ClassificationBanner" />
    </category>
    <category name="CAT_ClassificationBanner_ThreatLevels"
      displayName="$(string.CAT_ClassificationBanner_ThreatLevels)">
      <parentCategory ref="CAT_ClassificationBanner" />
    </category>
    <category name="CAT_ClassificationBanner_Appearance"
      displayName="$(string.CAT_ClassificationBanner_Appearance)">
      <parentCategory ref="CAT_ClassificationBanner" />
    </category>
  </categories>
  <policies>
    <!-- Enable/Disable Banner -->
    <policy name="POL_BannerEnabled" class="Machine" displayName="$(string.POL_BannerEnabled)"
      explainText="$(string.POL_BannerEnabled_Help)" key="SOFTWARE\ClassificationBanner"
      valueName="Enabled">
      <parentCategory ref="CAT_ClassificationBanner_Display" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>

    <!-- Classification Level -->
    <policy name="POL_Classification" class="Machine" displayName="$(string.POL_Classification)"
      explainText="$(string.POL_Classification_Help)"
      presentation="$(presentation.POL_Classification)" key="SOFTWARE\ClassificationBanner">
      <parentCategory ref="CAT_ClassificationBanner_Display" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <elements>
        <enum id="ENUM_ClassificationLevel" valueName="Classification" required="true">
          <item displayName="$(string.ENUM_Classification_Unclassified)">
            <value>
              <string>UNCLASSIFIED</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_Classification_CUI)">
            <value>
              <string>CUI</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_Classification_Confidential)">
            <value>
              <string>CONFIDENTIAL</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_Classification_Secret)">
            <value>
              <string>SECRET</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_Classification_TopSecret)">
            <value>
              <string>TOP SECRET</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_Classification_TopSecretSCI)">
            <value>
              <string>SCI</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_Classification_Custom)">
            <value>
              <string>CUSTOM</string>
            </value>
          </item>
        </enum>
        <text id="TXT_CustomClassification" valueName="CustomClassification" maxLength="50" />
      </elements>
    </policy>

    <!-- Caveats -->
    <policy name="POL_Caveats" class="Machine" displayName="$(string.POL_Caveats)"
      explainText="$(string.POL_Caveats_Help)"
      presentation="$(presentation.POL_Caveats)" key="SOFTWARE\ClassificationBanner">
      <parentCategory ref="CAT_ClassificationBanner_Display" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <elements>
        <text id="TXT_Caveats" valueName="Caveats" maxLength="50" />
      </elements>
    </policy>
    
    <!-- DisseminationControls Level -->
    <policy name="POL_DisseminationControls" class="Machine" displayName="$(string.POL_DisseminationControls)"
      explainText="$(string.POL_DisseminationControls_Help)"
      presentation="$(presentation.POL_DisseminationControls)" key="SOFTWARE\ClassificationBanner">
      <parentCategory ref="CAT_ClassificationBanner_Display" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <elements>
        <text id="TXT_DisseminationControls" valueName="DisseminationControls" maxLength="50" />
      </elements>
    </policy>

    <!-- FPCON Level -->
    <policy name="POL_FPCON" class="Machine" displayName="$(string.POL_FPCON)"
      explainText="$(string.POL_FPCON_Help)" presentation="$(presentation.POL_FPCON)"
      key="SOFTWARE\ClassificationBanner">
      <parentCategory ref="CAT_ClassificationBanner_ThreatLevels" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <elements>
        <enum id="ENUM_FPCON" valueName="FPCON">
          <item displayName="$(string.ENUM_FPCON_Alpha)">
            <value>
              <string>Alpha</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_FPCON_Bravo)">
            <value>
              <string>Bravo</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_FPCON_Charlie)">
            <value>
              <string>Charlie</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_FPCON_Delta)">
            <value>
              <string>Delta</string>
            </value>
          </item>
        </enum>
      </elements>
    </policy>

    <!-- CPCON Level -->
    <policy name="POL_CPCON" class="Machine" displayName="$(string.POL_CPCON)"
      explainText="$(string.POL_CPCON_Help)" presentation="$(presentation.POL_CPCON)"
      key="SOFTWARE\ClassificationBanner">
      <parentCategory ref="CAT_ClassificationBanner_ThreatLevels" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <elements>
        <enum id="ENUM_CPCON" valueName="CPCON">
          <item displayName="$(string.ENUM_CPCON_1)">
            <value>
              <string>1</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_CPCON_2)">
            <value>
              <string>2</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_CPCON_3)">
            <value>
              <string>3</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_CPCON_4)">
            <value>
              <string>4</string>
            </value>
          </item>
          <item displayName="$(string.ENUM_CPCON_5)">
            <value>
              <string>5</string>
            </value>
          </item>
        </enum>
      </elements>
    </policy>

    <!-- System Information Display -->
    <policy name="POL_ShowHostname" class="Machine" displayName="$(string.POL_ShowHostname)"
      explainText="$(string.POL_ShowHostname_Help)" key="SOFTWARE\ClassificationBanner"
      valueName="ShowHostname">
      <parentCategory ref="CAT_ClassificationBanner_SystemInfo" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>

    <policy name="POL_ShowUsername" class="Machine"
      displayName="$(string.POL_ShowUsername)"
      explainText="$(string.POL_ShowUsername_Help)" key="SOFTWARE\ClassificationBanner"
      valueName="ShowUsername">
      <parentCategory ref="CAT_ClassificationBanner_SystemInfo" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>

    <policy name="POL_ShowWindowsVersion" class="Machine"
      displayName="$(string.POL_ShowWindowsVersion)"
      explainText="$(string.POL_ShowWindowsVersion_Help)" key="SOFTWARE\ClassificationBanner"
      valueName="ShowWindowsVersion">
      <parentCategory ref="CAT_ClassificationBanner_SystemInfo" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>

    <policy name="POL_ShowIPAddress" class="Machine" displayName="$(string.POL_ShowIPAddress)"
      explainText="$(string.POL_ShowIPAddress_Help)" key="SOFTWARE\ClassificationBanner"
      valueName="ShowIPAddress">
      <parentCategory ref="CAT_ClassificationBanner_SystemInfo" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>

    <policy name="POL_ShowGroupID" class="Machine" displayName="$(string.POL_ShowGroupID)"
      explainText="$(string.POL_ShowGroupID_Help)" presentation="$(presentation.POL_ShowGroupID)"
      key="SOFTWARE\ClassificationBanner" valueName="GroupID">
      <parentCategory ref="CAT_ClassificationBanner_SystemInfo" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
      <elements>
        <text id="TXT_GroupID" valueName="GroupID" maxLength="50" />
      </elements>
    </policy>

    <!-- Appearance Settings -->
    <policy name="POL_CustomColors" class="Machine" displayName="$(string.POL_CustomColors)"
      explainText="$(string.POL_CustomColors_Help)" presentation="$(presentation.POL_CustomColors)"
      key="SOFTWARE\ClassificationBanner" valueName="TextColor">
      <parentCategory ref="CAT_ClassificationBanner_Appearance" />
      <supportedOn ref="windows:SUPPORTED_Windows10" />
      <elements>
        <text id="TXT_BackgroundColor" valueName="BackgroundColor" maxLength="7" />
        <text id="TXT_TextColor" valueName="TextColor" maxLength="7" />
      </elements>
    </policy>
  </policies>
</policyDefinitions>